Documents/ПоступлениеЗапасовУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ПоступлениеЗапасовУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСПоставщиками</xr:Item>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокументаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>Ставка НДС по умолчанию для оформления документов</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОсновныеУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>Ставка НДС по умолчанию для оформления документов</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрочиеУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>Ставка НДС по умолчанию для оформления документов</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ЗапасыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ЗапасыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсновнаяУслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочаяУслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоступлениеЗапасовУслуг/Ext/ManagerModule.bsl
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаПоступлениеЗапасовУслуг, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаЗапасы.НомерСтроки КАК НомерСтроки,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ВременнаяТаблицаЗапасы.Период КАК Период,
		|	ВременнаяТаблицаЗапасы.Организация КАК Организация,
		|	ВременнаяТаблицаЗапасы.Склад КАК Склад,
		|	ВременнаяТаблицаЗапасы.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблицаЗапасы.Количество КАК Количество
		|ИЗ
		|	ВременнаяТаблицаЗапасы КАК ВременнаяТаблицаЗапасы";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладах", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаЗапасыНаСкладах()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВзаиморасчетыСКонтрагентами(ДокументСсылкаПоступлениеЗапасовУслуг, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ 
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ВременнаяТаблицаРасчеты.Период КАК Период,
		|	ВременнаяТаблицаРасчеты.Организация КАК Организация,
		|	ВременнаяТаблицаРасчеты.Контрагент КАК Контрагент,
		|	ВременнаяТаблицаРасчеты.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	&Запас КАК ВидНоменклатуры,
		|	ВременнаяТаблицаРасчеты.Сумма КАК СуммаВзаиморасчетов
		|ИЗ
		|	ВременнаяТаблицаЗапасыРасчет КАК ВременнаяТаблицаРасчеты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ 
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	ВременнаяТаблицаРасчеты.Период,
		|	ВременнаяТаблицаРасчеты.Организация,
		|	ВременнаяТаблицаРасчеты.Контрагент,
		|	ВременнаяТаблицаРасчеты.ДоговорКонтрагента,
		|	&ОсновныеУслуги КАК ВидНоменклатуры,
		|	ВременнаяТаблицаРасчеты.Сумма КАК СуммаВзаиморасчетов
		|ИЗ
		|	ВременнаяТаблицаОсновныеУслугиРасчет КАК ВременнаяТаблицаРасчеты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ 
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	ВременнаяТаблицаРасчеты.Период,
		|	ВременнаяТаблицаРасчеты.Организация,
		|	ВременнаяТаблицаРасчеты.Контрагент,
		|	ВременнаяТаблицаРасчеты.ДоговорКонтрагента,
		|	&ПрочиеУслуги КАК ВидНоменклатуры,
		|	ВременнаяТаблицаРасчеты.Сумма КАК СуммаВзаиморасчетов
		|ИЗ
		|	ВременнаяТаблицаПрочиеУслугиРасчет КАК ВременнаяТаблицаРасчеты";

	Запрос.УстановитьПараметр("Запас", Перечисления.ВидыНоменклатуры.Запас);
	Запрос.УстановитьПараметр("ОсновныеУслуги", Перечисления.ВидыНоменклатуры.ОсновнаяУслуга);
	Запрос.УстановитьПараметр("ПрочиеУслуги", Перечисления.ВидыНоменклатуры.ПрочаяУслуга);

	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетыСКонтрагентами", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаВзаиморасчетыСКонтрагентами()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЦеныНоменклатуры(ДокументСсылкаУстановкаЦенНоменклатуры, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаЗапасы.ТипЦены КАК ТипЦены,
		|	ВременнаяТаблицаЗапасы.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблицаЗапасы.Цена КАК Цена,
		|	ВременнаяТаблицаЗапасы.Период КАК Период
		|ИЗ
		|	ВременнаяТаблицаЗапасы КАК ВременнаяТаблицаЗапасы
		|ГДЕ
		|	ВременнаяТаблицаЗапасы.ТипЦены <> &ПустаяЦена
		|	И ВременнаяТаблицаЗапасы.РегистрироватьЦены = ИСТИНА";
		
	Запрос.УстановитьПараметр("ПустаяЦена", Перечисления.ТипыЦенНоменклатуры.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЦеныНоменклатуры", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаЦеныНоменклатуры()

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаПоступлениеЗапасовУслуг, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПоступлениеЗапасовУслугЗапасы.НомерСтроки,
		|	ПоступлениеЗапасовУслугЗапасы.Ссылка.Дата КАК Период,
		|	ПоступлениеЗапасовУслугЗапасы.Ссылка.Организация,
		|	ПоступлениеЗапасовУслугЗапасы.Ссылка.Склад,
		|	ПоступлениеЗапасовУслугЗапасы.Номенклатура,
		|	ПоступлениеЗапасовУслугЗапасы.Количество,
		|	ПоступлениеЗапасовУслугЗапасы.Цена,
		|	ПоступлениеЗапасовУслугЗапасы.Ссылка.ТипЦены,
		|	ПоступлениеЗапасовУслугЗапасы.Ссылка.РегистрироватьЦены
		|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
		|ИЗ
		|	Документ.ПоступлениеЗапасовУслуг.Запасы КАК ПоступлениеЗапасовУслугЗапасы
		|ГДЕ
		|	ПоступлениеЗапасовУслугЗапасы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоступлениеЗапасовУслугЗапасы.Ссылка.Дата КАК Период,
		|	ПоступлениеЗапасовУслугЗапасы.Ссылка.Организация,
		|	ПоступлениеЗапасовУслугЗапасы.Ссылка.Контрагент,
		|	ПоступлениеЗапасовУслугЗапасы.Ссылка.ДоговорКонтрагента,
		|	СУММА(ПоступлениеЗапасовУслугЗапасы.Всего) КАК Сумма
		|ПОМЕСТИТЬ ВременнаяТаблицаЗапасыРасчет
		|ИЗ
		|	Документ.ПоступлениеЗапасовУслуг.Запасы КАК ПоступлениеЗапасовУслугЗапасы
		|ГДЕ
		|	ПоступлениеЗапасовУслугЗапасы.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеЗапасовУслугЗапасы.Ссылка.Дата,
		|	ПоступлениеЗапасовУслугЗапасы.Ссылка.Организация,
		|	ПоступлениеЗапасовУслугЗапасы.Ссылка.Контрагент,
		|	ПоступлениеЗапасовУслугЗапасы.Ссылка.ДоговорКонтрагента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоступлениеЗапасовУслугОсновныеУслуги.Ссылка.Дата КАК Период,
		|	ПоступлениеЗапасовУслугОсновныеУслуги.Ссылка.Организация,
		|	ПоступлениеЗапасовУслугОсновныеУслуги.Ссылка.Контрагент,
		|	ПоступлениеЗапасовУслугОсновныеУслуги.Ссылка.ДоговорКонтрагента,
		|	СУММА(ПоступлениеЗапасовУслугОсновныеУслуги.Всего) КАК Сумма
		|ПОМЕСТИТЬ ВременнаяТаблицаОсновныеУслугиРасчет
		|ИЗ
		|	Документ.ПоступлениеЗапасовУслуг.ОсновныеУслуги КАК ПоступлениеЗапасовУслугОсновныеУслуги
		|ГДЕ
		|	ПоступлениеЗапасовУслугОсновныеУслуги.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеЗапасовУслугОсновныеУслуги.Ссылка.Дата,
		|	ПоступлениеЗапасовУслугОсновныеУслуги.Ссылка.Организация,
		|	ПоступлениеЗапасовУслугОсновныеУслуги.Ссылка.Контрагент,
		|	ПоступлениеЗапасовУслугОсновныеУслуги.Ссылка.ДоговорКонтрагента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоступлениеЗапасовУслугПрочиеУслуги.Ссылка.Дата КАК Период,
		|	ПоступлениеЗапасовУслугПрочиеУслуги.Ссылка.Организация,
		|	ПоступлениеЗапасовУслугПрочиеУслуги.Ссылка.Контрагент,
		|	ПоступлениеЗапасовУслугПрочиеУслуги.Ссылка.ДоговорКонтрагента,
		|	СУММА(ПоступлениеЗапасовУслугПрочиеУслуги.Всего) КАК Сумма
		|ПОМЕСТИТЬ ВременнаяТаблицаПрочиеУслугиРасчет
		|ИЗ
		|	Документ.ПоступлениеЗапасовУслуг.ПрочиеУслуги КАК ПоступлениеЗапасовУслугПрочиеУслуги
		|ГДЕ
		|	ПоступлениеЗапасовУслугПрочиеУслуги.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеЗапасовУслугПрочиеУслуги.Ссылка.Дата,
		|	ПоступлениеЗапасовУслугПрочиеУслуги.Ссылка.Организация,
		|	ПоступлениеЗапасовУслугПрочиеУслуги.Ссылка.Контрагент,
		|	ПоступлениеЗапасовУслугПрочиеУслуги.Ссылка.ДоговорКонтрагента";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПоступлениеЗапасовУслуг);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаПоступлениеЗапасовУслуг, СтруктураДополнительныеСвойства);
	СформироватьТаблицаВзаиморасчетыСКонтрагентами(ДокументСсылкаПоступлениеЗапасовУслуг, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЦеныНоменклатуры(ДокументСсылкаПоступлениеЗапасовУслуг, СтруктураДополнительныеСвойства);
		
КонецПроцедуры

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылкаПоступлениеЗапасовУслуг, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	Если Не ПроведениеСервер.ВыполнитьКонтрольОстатков() Тогда
		Возврат;
	КонецЕсли;

	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Если временные таблицы "ДвиженияЗапасыНаСкладахИзменение"
	// содержат записи, необходимо выполнить контроль отрицательных остатков.
	
	Если СтруктураВременныеТаблицы.ДвиженияЗапасыНаСкладахИзменение Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДвиженияЗапасыНаСкладахИзменение.НомерСтроки КАК НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыНаСкладахИзменение.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыНаСкладахИзменение.Склад) КАК СкладПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыНаСкладахИзменение.Номенклатура) КАК НоменклатураПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗапасыНаСкладахОстатки.Номенклатура.БазоваяЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
		|	ЕСТЬNULL(ДвиженияЗапасыНаСкладахИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасыНаСкладах,
		|	ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасыНаСкладах
		|ИЗ
		|	ДвиженияЗапасыНаСкладахИзменение КАК ДвиженияЗапасыНаСкладахИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыНаСкладах.Остатки(
		|				&МоментКонтроля,
		|				(Организация, Склад, Номенклатура) В
		|					(ВЫБРАТЬ
		|						ДвиженияЗапасыНаСкладахИзменение.Организация КАК Организация,
		|						ДвиженияЗапасыНаСкладахИзменение.Склад КАК Склад,
		|						ДвиженияЗапасыНаСкладахИзменение.Номенклатура КАК Номенклатура
		|					ИЗ
		|						ДвиженияЗапасыНаСкладахИзменение КАК ДвиженияЗапасыНаСкладахИзменение)) КАК ЗапасыНаСкладахОстатки
		|		ПО ДвиженияЗапасыНаСкладахИзменение.Организация = ЗапасыНаСкладахОстатки.Организация
		|			И ДвиженияЗапасыНаСкладахИзменение.Склад = ЗапасыНаСкладахОстатки.Склад
		|			И ДвиженияЗапасыНаСкладахИзменение.Номенклатура = ЗапасыНаСкладахОстатки.Номенклатура
		|ГДЕ
		|	ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) < 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки");
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("МоментКонтроля", ДополнительныеСвойства.ДляПроведения.МоментКонтроля);
		
		РезультатЗапроса = Запрос.Выполнить();

		// Отрицательный остаток запасов на складе.
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			ДокументОбъектПоступлениеЗапасовУслуг = ДокументСсылкаПоступлениеЗапасовУслуг.ПолучитьОбъект();
			
			ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
			ОСМДСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасыНаСкладахСписком(ДокументОбъектПоступлениеЗапасовУслуг, ВыборкаИзРезультатаЗапроса, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Функция формирует печатную форму документа по указанному макету.
//
// Параметры:
//	ТабличныйДокумент - ТабличныйДокумент в который будет выводится печатная
//				   форма.
//  ИмяМакета    - Строка, имя макета печатной формы.
//
Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ПоступлениеЗапасовУслуг";
	
	ПервыйДокумент = Истина;
	
	Для каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		
		Если ИмяМакета = "ПоступлениеЗапасовИУслуг" Тогда
			
			КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм();	
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ПоступлениеЗапасовУслуг.Дата КАК ДатаДокумента,
			|	ПоступлениеЗапасовУслуг.Контрагент КАК Контрагент,
			|	ПоступлениеЗапасовУслуг.Организация КАК Организация,
			|	ПоступлениеЗапасовУслуг.ВключаетНДС КАК СуммаВключаетНДС,
			|	ПоступлениеЗапасовУслуг.Номер,
			|	ПоступлениеЗапасовУслуг.Организация.Префикс КАК Префикс,
			|	ПоступлениеЗапасовУслуг.Запасы.(
			|		НомерСтроки КАК НомерСтроки,
			|		ВЫБОР
			|			КОГДА (ВЫРАЗИТЬ(ПоступлениеЗапасовУслуг.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))) = """"
			|				ТОГДА ПоступлениеЗапасовУслуг.Запасы.Номенклатура.Наименование
			|			ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеЗапасовУслуг.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))
			|		КОНЕЦ КАК Номенклатура,
			|		Номенклатура.Код КАК Код,
			|		Количество КАК Количество,
			|		Цена КАК Цена,
			|		Сумма КАК Сумма,
			|		СуммаНДС,
			|		Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения
			|	),
			|	ПоступлениеЗапасовУслуг.ОсновныеУслуги.(
			|		НомерСтроки КАК НомерСтроки,
			|		ВЫБОР
			|			КОГДА (ВЫРАЗИТЬ(ПоступлениеЗапасовУслуг.ОсновныеУслуги.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))) = """"
			|				ТОГДА ПоступлениеЗапасовУслуг.ОсновныеУслуги.Номенклатура.Наименование
			|			ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеЗапасовУслуг.ОсновныеУслуги.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))
			|		КОНЕЦ КАК Номенклатура,
			|		Номенклатура.Код КАК Код,
			|		Количество КАК Количество,
			|		Цена КАК Цена,
			|		Сумма КАК Сумма,
			|		СуммаНДС,
			|		Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения
			|	),
			|	ПоступлениеЗапасовУслуг.ПрочиеУслуги.(
			|		НомерСтроки КАК НомерСтроки,
			|		ВЫБОР
			|			КОГДА (ВЫРАЗИТЬ(ПоступлениеЗапасовУслуг.ПрочиеУслуги.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))) = """"
			|				ТОГДА ПоступлениеЗапасовУслуг.ПрочиеУслуги.Номенклатура.Наименование
			|			ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеЗапасовУслуг.ПрочиеУслуги.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))
			|		КОНЕЦ КАК Номенклатура,
			|		Номенклатура.Код КАК Код,
			|		Количество КАК Количество,
			|		Цена КАК Цена,
			|		Сумма КАК Сумма,
			|		СуммаНДС,
			|		Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения
			|	),
			|	ПоступлениеЗапасовУслуг.СуммаДокумента,
			|	ПоступлениеЗапасовУслуг.СуммаДокументаНДС КАК СуммаНДС,
			|	ПоступлениеЗапасовУслуг.СуммаДокумента - ПоступлениеЗапасовУслуг.СуммаДокументаНДС КАК СуммаБезНДС
			|ИЗ
			|	Документ.ПоступлениеЗапасовУслуг КАК ПоступлениеЗапасовУслуг
			|ГДЕ
			|	ПоступлениеЗапасовУслуг.Ссылка = &ТекущийДокумент
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			
			Шапка = Запрос.Выполнить().Выбрать();
			Шапка.Следующий();
			 	
			ВыборкаСтрокЗапасы = Шапка.Запасы.Выбрать();
			ВыборкаСтрокОсновныеУслуги = Шапка.ОсновныеУслуги.Выбрать();
            ВыборкаСтрокПрочиеУслуги = Шапка.ПрочиеУслуги.Выбрать();
			
			ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПоступлениеЗапасовУслуг";
			
			Макет = УправлениеПечатью.ПолучитьМакет("Документ.ПоступлениеЗапасовУслуг.ПФ_MXL_ПоступлениеЗапасовИУслуг");
			
			Макет.КодЯзыкаМакета = КодЯзыкаПечать;
			
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьМакета, ТекущийДокумент.Ссылка);
			ОбластьМакета.Параметры.ТекстЗаголовка = НСтр("ru='Поступление запасов и услуг № ';uk='Надходження запасів і послуг №'", КодЯзыкаПечать)
				+ НомерДокумента
				+ НСтр("ru=' от ';uk=' від '", КодЯзыкаПечать)
				+ Формат(Шапка.ДатаДокумента, "Л="+КодЯзыкаПечать+"; ДЛФ=DD");
				
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
			ОбластьМакета.Параметры.Заполнить(Шапка);
		    ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыЗапасы");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаЗапасы");
			
			Сумма	   = 0;
			СуммаНДС   = 0;
			Количество = 0;
			
			Пока ВыборкаСтрокЗапасы.Следующий() Цикл
				
				ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокЗапасы);
						
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Сумма = Сумма + ВыборкаСтрокЗапасы.Сумма;
				СуммаНДС = СуммаНДС + ВыборкаСтрокЗапасы.СуммаНДС;
				Количество = Количество + 1;
				
			КонецЦикла;
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыОсновныеУслуги");
			
			Если ВыборкаСтрокОсновныеУслуги.Количество() > 0 Тогда
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаОсновныеУслуги");
			
			Сумма	   = 0;
			СуммаНДС   = 0;
			Количество = 0;
			
			Пока ВыборкаСтрокОсновныеУслуги.Следующий() Цикл
				
				ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокОсновныеУслуги);
						
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Сумма = Сумма + ВыборкаСтрокЗапасы.Сумма;
				СуммаНДС = СуммаНДС + ВыборкаСтрокЗапасы.СуммаНДС;
				Количество = Количество + 1;
				
			КонецЦикла;
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыПрочиеУслуги");
			Если ВыборкаСтрокПрочиеУслуги.Количество() > 0 Тогда
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
			КонецЕсли;
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПрочиеУслуги");
			
			Сумма	   = 0;
			СуммаНДС   = 0;
			Количество = 0;
			
			Пока ВыборкаСтрокПрочиеУслуги.Следующий() Цикл
				
				ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокПрочиеУслуги);
						
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Сумма = Сумма + ВыборкаСтрокЗапасы.Сумма;
				СуммаНДС = СуммаНДС + ВыборкаСтрокЗапасы.СуммаНДС;
				Количество = Количество + 1;
				
			КонецЦикла;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Итого");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНДС");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ТабличныйДокумент.Вывести(ОбластьМакета);

			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоСНДС");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ТабличныйДокумент.Вывести(ОбластьМакета);

			ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
			ТабличныйДокумент.Вывести(ОбластьМакета);
				
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов,
				 ПараметрыПечати,
				 КоллекцияПечатныхФорм,
				 ОбъектыПечати,
				 ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПоступлениеЗапасовУслуг") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПоступлениеЗапасовУслуг", "Поступление запасов и услуг", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ПоступлениеЗапасовИУслуг"));
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьДанныеПечати(знач МассивДокументов, знач МассивИменМакетов) Экспорт
	
	ДанныеПоВсемОбъектам = Новый Соответствие;
	ОписаниеОбластей = Новый Соответствие;
	ДвоичныеДанныеМакетов = Новый Соответствие;
	ТипыМакетов = Новый Соответствие;
	
	Возврат Новый Структура("Данные, Макеты",
							ДанныеПоВсемОбъектам,
							Новый Структура("ОписаниеОбластей, ТипыМакетов, ДвоичныеДанныеМакетов",
											ОписаниеОбластей,
											ТипыМакетов,
											ДвоичныеДанныеМакетов));
	
КонецФункции
